MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L552ZE/mcu.h
/*@}*/ /* end of group STM32L5xx_peripherals */


/* --------  End of section using anonymous unions and disabling warnings  -------- */
#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined (__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup STM32L5xx_Peripheral_peripheralAddr
  * @{
  */

/* Internal SRAMs size */
#define SRAM1_SIZE            0x30000UL  /*!< SRAM1=192k*/
#define SRAM2_SIZE            0x10000UL  /*!< SRAM2=64k*/

/* External memories base addresses - Not aliased */
#define FMC_BASE              (0x60000000UL) /*!< FMC base address */
#define OCTOSPI1_BASE         (0x90000000UL) /*!< OCTOSPI1 memories accessible over AHB base address */

#define FMC_BANK1             FMC_BASE
#define FMC_BANK1_1           FMC_BANK1
#define FMC_BANK1_2           (FMC_BANK1 + 0x04000000UL)
#define FMC_BANK1_3           (FMC_BANK1 + 0x08000000UL)
#define FMC_BANK1_4           (FMC_BANK1 + 0x0C000000UL)
#define FMC_BANK3             (FMC_BASE  + 0x20000000UL)

/* Flash, Peripheral and internal SRAMs base addresses - Non secure aliased */
#define FLASH_BASE_NS         (0x08000000UL) /*!< FLASH(up to 512 KB) base address */
#define SRAM1_BASE_NS         (0x20000000UL) /*!< SRAM1(up to 192 KB) base address */
#define SRAM2_BASE_NS         (0x20030000UL) /*!< SRAM2(64 KB) base address */
#define SRAM_BASE_NS          SRAM1_BASE
#define PERIPH_BASE_NS        (0x40000000UL) /*!< Peripheral non secure base address */

/* Peripheral memory map - Non secure */
#define APB1PERIPH_BASE_NS    PERIPH_BASE_NS
#define APB2PERIPH_BASE_NS    (PERIPH_BASE_NS + 0x00010000UL)
#define AHB1PERIPH_BASE_NS    (PERIPH_BASE_NS + 0x00020000UL)
#define AHB2PERIPH_BASE_NS    (PERIPH_BASE_NS + 0x02020000UL)
#define AHB3PERIPH_BASE_NS    (PERIPH_BASE_NS + 0x04020000UL)

/*!< APB1 Non secure peripherals */
#define TIM2_BASE_NS          (APB1PERIPH_BASE_NS + 0x0000UL)
#define TIM3_BASE_NS          (APB1PERIPH_BASE_NS + 0x0400UL)
#define TIM4_BASE_NS          (APB1PERIPH_BASE_NS + 0x0800UL)
#define TIM5_BASE_NS          (APB1PERIPH_BASE_NS + 0x0C00UL)
#define TIM6_BASE_NS          (APB1PERIPH_BASE_NS + 0x1000UL)
#define TIM7_BASE_NS          (APB1PERIPH_BASE_NS + 0x1400UL)
#define RTC_BASE_NS           (APB1PERIPH_BASE_NS + 0x2800UL)
#define WWDG_BASE_NS          (APB1PERIPH_BASE_NS + 0x2C00UL)
#define IWDG_BASE_NS          (APB1PERIPH_BASE_NS + 0x3000UL)
#define TAMP_BASE_NS          (APB1PERIPH_BASE_NS + 0x3400UL)
#define SPI2_BASE_NS          (APB1PERIPH_BASE_NS + 0x3800UL)
#define SPI3_BASE_NS          (APB1PERIPH_BASE_NS + 0x3C00UL)
#define USART2_BASE_NS        (APB1PERIPH_BASE_NS + 0x4400UL)
#define USART3_BASE_NS        (APB1PERIPH_BASE_NS + 0x4800UL)
#define UART4_BASE_NS         (APB1PERIPH_BASE_NS + 0x4C00UL)
#define UART5_BASE_NS         (APB1PERIPH_BASE_NS + 0x5000UL)
#define I2C1_BASE_NS          (APB1PERIPH_BASE_NS + 0x5400UL)
#define I2C2_BASE_NS          (APB1PERIPH_BASE_NS + 0x5800UL)
#define I2C3_BASE_NS          (APB1PERIPH_BASE_NS + 0x5C00UL)
#define CRS_BASE_NS           (APB1PERIPH_BASE_NS + 0x6000UL)
#define PWR_BASE_NS           (APB1PERIPH_BASE_NS + 0x7000UL)
#define DAC_BASE_NS           (APB1PERIPH_BASE_NS + 0x7400UL)
#define DAC1_BASE_NS          (APB1PERIPH_BASE_NS + 0x7400UL)
#define OPAMP_BASE_NS         (APB1PERIPH_BASE_NS + 0x7800UL)
#define OPAMP1_BASE_NS        (APB1PERIPH_BASE_NS + 0x7800UL)
#define OPAMP2_BASE_NS        (APB1PERIPH_BASE_NS + 0x7810UL)
#define LPTIM1_BASE_NS        (APB1PERIPH_BASE_NS + 0x7C00UL)
#define LPUART1_BASE_NS       (APB1PERIPH_BASE_NS + 0x8000UL)
#define I2C4_BASE_NS          (APB1PERIPH_BASE_NS + 0x8400UL)
#define LPTIM2_BASE_NS        (APB1PERIPH_BASE_NS + 0x9400UL)
#define LPTIM3_BASE_NS        (APB1PERIPH_BASE_NS + 0x9800UL)
#define FDCAN1_BASE_NS        (APB1PERIPH_BASE_NS + 0xA400UL)
#define FDCAN_CONFIG_BASE_NS  (APB1PERIPH_BASE_NS + 0xA500UL)  /*!< FDCAN configuration registers base address */
#define SRAMCAN_BASE_NS       (APB1PERIPH_BASE_NS + 0xAC00UL)
#define USB_BASE_NS           (APB1PERIPH_BASE_NS + 0xD400UL)  /*!< USB_IP Peripheral Registers base address */
#define USB_PMAADDR_NS        (APB1PERIPH_BASE_NS + 0xD800UL)  /*!< USB_IP Packet Memory Area base address */
#define UCPD1_BASE_NS         (APB1PERIPH_BASE_NS + 0xDC00UL)

/*!< APB2 Non secure peripherals */
#define SYSCFG_BASE_NS        (APB2PERIPH_BASE_NS + 0x0000UL)
#define VREFBUF_BASE_NS       (APB2PERIPH_BASE_NS + 0x0100UL)
#define COMP1_BASE_NS         (APB2PERIPH_BASE_NS + 0x0200UL)
#define COMP2_BASE_NS         (APB2PERIPH_BASE_NS + 0x0204UL)
#define TIM1_BASE_NS          (APB2PERIPH_BASE_NS + 0x2C00UL)
#define SPI1_BASE_NS          (APB2PERIPH_BASE_NS + 0x3000UL)
#define TIM8_BASE_NS          (APB2PERIPH_BASE_NS + 0x3400UL)
#define USART1_BASE_NS        (APB2PERIPH_BASE_NS + 0x3800UL)
#define TIM15_BASE_NS         (APB2PERIPH_BASE_NS + 0x4000UL)
#define TIM16_BASE_NS         (APB2PERIPH_BASE_NS + 0x4400UL)
#define TIM17_BASE_NS         (APB2PERIPH_BASE_NS + 0x4800UL)
#define SAI1_BASE_NS          (APB2PERIPH_BASE_NS + 0x5400UL)
#define SAI1_Block_A_BASE_NS  (SAI1_BASE_NS + 0x0004UL)
#define SAI1_Block_B_BASE_NS  (SAI1_BASE_NS + 0x0024UL)
#define SAI2_BASE_NS          (APB2PERIPH_BASE_NS + 0x5800UL)
#define SAI2_Block_A_BASE_NS  (SAI2_BASE_NS + 0x0004UL)
#define SAI2_Block_B_BASE_NS  (SAI2_BASE_NS + 0x0024UL)
#define DFSDM1_BASE_NS        (APB2PERIPH_BASE_NS + 0x6000UL)
#define DFSDM1_Channel0_BASE_NS (DFSDM1_BASE_NS + 0x0000UL)
#define DFSDM1_Channel1_BASE_NS (DFSDM1_BASE_NS + 0x0020UL)
#define DFSDM1_Channel2_BASE_NS (DFSDM1_BASE_NS + 0x0040UL)
#define DFSDM1_Channel3_BASE_NS (DFSDM1_BASE_NS + 0x0060UL)
#define DFSDM1_Filter0_BASE_NS  (DFSDM1_BASE_NS + 0x0100UL)
#define DFSDM1_Filter1_BASE_NS  (DFSDM1_BASE_NS + 0x0180UL)
#define DFSDM1_Filter2_BASE_NS  (DFSDM1_BASE_NS + 0x0200UL)
#define DFSDM1_Filter3_BASE_NS  (DFSDM1_BASE_NS + 0x0280UL)

