MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L552ZE/mcu.h
#define DMA2_Channel1_BASE_S  (DMA2_BASE_S + 0x0008UL)
#define DMA2_Channel2_BASE_S  (DMA2_BASE_S + 0x001CUL)
#define DMA2_Channel3_BASE_S  (DMA2_BASE_S + 0x0030UL)
#define DMA2_Channel4_BASE_S  (DMA2_BASE_S + 0x0044UL)
#define DMA2_Channel5_BASE_S  (DMA2_BASE_S + 0x0058UL)
#define DMA2_Channel6_BASE_S  (DMA2_BASE_S + 0x006CUL)
#define DMA2_Channel7_BASE_S  (DMA2_BASE_S + 0x0080UL)
#define DMA2_Channel8_BASE_S  (DMA2_BASE_S + 0x0094UL)

#define DMAMUX1_Channel0_BASE_S  (DMAMUX1_BASE_S)
#define DMAMUX1_Channel1_BASE_S  (DMAMUX1_BASE_S + 0x00000004UL)
#define DMAMUX1_Channel2_BASE_S  (DMAMUX1_BASE_S + 0x00000008UL)
#define DMAMUX1_Channel3_BASE_S  (DMAMUX1_BASE_S + 0x0000000CUL)
#define DMAMUX1_Channel4_BASE_S  (DMAMUX1_BASE_S + 0x00000010UL)
#define DMAMUX1_Channel5_BASE_S  (DMAMUX1_BASE_S + 0x00000014UL)
#define DMAMUX1_Channel6_BASE_S  (DMAMUX1_BASE_S + 0x00000018UL)
#define DMAMUX1_Channel7_BASE_S  (DMAMUX1_BASE_S + 0x0000001CUL)
#define DMAMUX1_Channel8_BASE_S  (DMAMUX1_BASE_S + 0x00000020UL)
#define DMAMUX1_Channel9_BASE_S  (DMAMUX1_BASE_S + 0x00000024UL)
#define DMAMUX1_Channel10_BASE_S (DMAMUX1_BASE_S + 0x00000028UL)
#define DMAMUX1_Channel11_BASE_S (DMAMUX1_BASE_S + 0x0000002CUL)
#define DMAMUX1_Channel12_BASE_S (DMAMUX1_BASE_S + 0x00000030UL)
#define DMAMUX1_Channel13_BASE_S (DMAMUX1_BASE_S + 0x00000034UL)
#define DMAMUX1_Channel14_BASE_S (DMAMUX1_BASE_S + 0x00000038UL)
#define DMAMUX1_Channel15_BASE_S (DMAMUX1_BASE_S + 0x0000003CUL)

#define DMAMUX1_RequestGenerator0_BASE_S (DMAMUX1_BASE_S + 0x00000100UL)
#define DMAMUX1_RequestGenerator1_BASE_S (DMAMUX1_BASE_S + 0x00000104UL)
#define DMAMUX1_RequestGenerator2_BASE_S (DMAMUX1_BASE_S + 0x00000108UL)
#define DMAMUX1_RequestGenerator3_BASE_S (DMAMUX1_BASE_S + 0x0000010CUL)

#define DMAMUX1_ChannelStatus_BASE_S     (DMAMUX1_BASE_S + 0x00000080UL)
#define DMAMUX1_RequestGenStatus_BASE_S  (DMAMUX1_BASE_S + 0x00000140UL)

/*!< AHB2 Secure peripherals */
#define GPIOA_BASE_S          (AHB2PERIPH_BASE_S + 0x0000UL)
#define GPIOB_BASE_S          (AHB2PERIPH_BASE_S + 0x0400UL)
#define GPIOC_BASE_S          (AHB2PERIPH_BASE_S + 0x0800UL)
#define GPIOD_BASE_S          (AHB2PERIPH_BASE_S + 0x0C00UL)
#define GPIOE_BASE_S          (AHB2PERIPH_BASE_S + 0x1000UL)
#define GPIOF_BASE_S          (AHB2PERIPH_BASE_S + 0x1400UL)
#define GPIOG_BASE_S          (AHB2PERIPH_BASE_S + 0x1800UL)
#define GPIOH_BASE_S          (AHB2PERIPH_BASE_S + 0x1C00UL)
#define ADC1_BASE_S           (AHB2PERIPH_BASE_S + 0x8000UL)
#define ADC2_BASE_S           (AHB2PERIPH_BASE_S + 0x8100UL)
#define ADC12_COMMON_BASE_S   (AHB2PERIPH_BASE_S + 0x8300UL)

#define HASH_BASE_S            (AHB2PERIPH_BASE_S + 0xA0400UL)
#define HASH_DIGEST_BASE_S     (AHB2PERIPH_BASE_S + 0xA0710UL)
#define RNG_BASE_S             (AHB2PERIPH_BASE_S + 0xA0800UL)
#define SDMMC1_BASE_S          (AHB2PERIPH_BASE_S + 0xA8000UL)

/*!< AHB3 Secure peripherals */
#define FMC_R_BASE_S          (AHB3PERIPH_BASE_S + 0x0000UL) /*!< FMC  control registers base address */
#define OCTOSPI1_R_BASE_S     (AHB3PERIPH_BASE_S + 0x1000UL) /*!< OCTOSPI1 control registers base address */

/*!< FMC Banks Secure registers base address */
#define FMC_Bank1_R_BASE_S    (FMC_R_BASE_S + 0x0000UL)
#define FMC_Bank1E_R_BASE_S   (FMC_R_BASE_S + 0x0104UL)
#define FMC_Bank3_R_BASE_S    (FMC_R_BASE_S + 0x0080UL)

/*!< Debug MCU registers base address */
#define DBGMCU_BASE           (0xE0044000UL)

#define PACKAGE_BASE          (0x0BFA0500UL)        /*!< Package data register base address     */
#define UID_BASE              (0x0BFA0590UL)        /*!< Unique device ID register base address */
#define FLASHSIZE_BASE        (0x0BFA05E0UL)        /*!< Flash size data register base address  */

/*!< Internal Flash size */
#define FLASH_SIZE            ((((*((uint16_t *)FLASHSIZE_BASE)) == 0xFFFFU)) ? 0x80000U : \
                               ((((*((uint16_t *)FLASHSIZE_BASE)) == 0x0000U)) ? 0x80000U : \
                                (((uint32_t)(*((uint16_t *)FLASHSIZE_BASE)) & (0x0FFFU)) << 10U)))

/*!< OTP Area */
#define OTP_BASE              (0x0BFA0000UL)
#define OTP_SIZE              (0x200U)

/*!< Bootloader Area */
#define BL_ID_ADDR            (0x0BF97FFEUL)          /*!< Bootloader ID address */
#define BL_ID                 (*(uint8_t*)BL_ID_ADDR) /*!< Bootloader ID */

/*!< Root Secure Service Library */
/************ RSSLIB SAU system Flash region definition constants *************/
#define RSSLIB_SYS_FLASH_NS_PFUNC_START   (0x0BF97F40UL)
#define RSSLIB_SYS_FLASH_NS_PFUNC_END     (0x0BF97FFFUL)

/************ RSSLIB function return constants ********************************/
#define RSSLIB_ERROR   (0xF5F5F5F5UL)
#define RSSLIB_SUCCESS (0xEAEAEAEAUL)

/*!< RSSLIB  pointer function structure address definition */
#define RSSLIB_PFUNC_BASE (0x0BF97F40UL)
#define RSSLIB_PFUNC      ((RSSLIB_pFunc_TypeDef *)RSSLIB_PFUNC_BASE)

/*!< HDP Area constant definition */
#define RSSLIB_HDP_AREA_Pos  (0U)
#define RSSLIB_HDP_AREA_Msk  (0x3UL << RSSLIB_HDP_AREA_Pos )
#define RSSLIB_HDP_AREA1_Pos (0U)
#define RSSLIB_HDP_AREA1_Msk (0x1UL << RSSLIB_HDP_AREA1_Pos )
#define RSSLIB_HDP_AREA2_Pos (1U)
#define RSSLIB_HDP_AREA2_Msk (0x1UL << RSSLIB_HDP_AREA2_Pos )

/**
  * @brief  Prototype of RSSLIB Close and exit HDP Function
  * @details This function close the requested hdp area passed in input
  *         parameter and jump to the reset handler present within the
  *         Vector table. The function does not return on successful execution.
  * @param  HdpArea notifies which hdp area to close, can be a combination of
  *         hdpa area 1 and hdp area 2
  * @param  VectorTableAddr pointer on the vector table containing the reset handler the function
  *         jumps to.
  * @retval RSSLIB_RSS_ERROR on error on input parameter, otherwise does not return.
  */
typedef uint32_t ( *RSSLIB_S_CloseExitHDP_TypeDef)( uint32_t HdpArea, uint32_t VectorTableAddr );


/**
  * @brief RSSLib non-secure callable function pointer structure
  */
typedef struct
{
  __IM uint32_t Reserved[8];
}NSC_pFuncTypeDef;

/**
  * @brief RSSLib secure callable function pointer structure
  */
typedef struct
{
  __IM RSSLIB_S_CloseExitHDP_TypeDef CloseExitHDP_BL90;        /*!< RSSLIB Bootloader ID90 Close and exit HDP  Address offset: 0x20 */
  __IM uint32_t Reserved2;
  __IM RSSLIB_S_CloseExitHDP_TypeDef CloseExitHDP_BL91;        /*!< RSSLIB Bootloader ID91 Close and exit HDP  Address offset: 0x28 */
}S_pFuncTypeDef;

/**
  * @brief RSSLib function pointer structure
  */
typedef struct
{
  NSC_pFuncTypeDef NSC;
  S_pFuncTypeDef S;
}RSSLIB_pFunc_TypeDef;

/** @} */ /* End of group STM32L5xx_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


