MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L552ZE/mcu.h
#define DMAMUX1_ChannelStatus_NS     ((DMAMUX_ChannelStatus_TypeDef *) DMAMUX1_ChannelStatus_BASE_NS)
#define DMAMUX1_RequestGenStatus_NS  ((DMAMUX_RequestGenStatus_TypeDef *) DMAMUX1_RequestGenStatus_BASE_NS)

/*!< AHB2 Non secure peripherals */
#define GPIOA_NS            ((GPIO_TypeDef *) GPIOA_BASE_NS)
#define GPIOB_NS            ((GPIO_TypeDef *) GPIOB_BASE_NS)
#define GPIOC_NS            ((GPIO_TypeDef *) GPIOC_BASE_NS)
#define GPIOD_NS            ((GPIO_TypeDef *) GPIOD_BASE_NS)
#define GPIOE_NS            ((GPIO_TypeDef *) GPIOE_BASE_NS)
#define GPIOF_NS            ((GPIO_TypeDef *) GPIOF_BASE_NS)
#define GPIOG_NS            ((GPIO_TypeDef *) GPIOG_BASE_NS)
#define GPIOH_NS            ((GPIO_TypeDef *) GPIOH_BASE_NS)
#define ADC1_NS             ((ADC_TypeDef *) ADC1_BASE_NS)
#define ADC2_NS             ((ADC_TypeDef *) ADC2_BASE_NS)
#define ADC12_COMMON_NS     ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_NS)
#define HASH_NS             ((HASH_TypeDef *) HASH_BASE_NS)
#define HASH_DIGEST_NS      ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_NS)
#define RNG_NS              ((RNG_TypeDef *) RNG_BASE_NS)
#define SDMMC1_NS           ((SDMMC_TypeDef *) SDMMC1_BASE_NS)

/*!< AHB3 Non secure peripherals */
#define FMC_Bank1_R_NS      ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE_NS)
#define FMC_Bank1E_R_NS     ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE_NS)
#define FMC_Bank3_R_NS      ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE_NS)

#define OCTOSPI1_NS         ((OCTOSPI_TypeDef *) OCTOSPI1_R_BASE_NS)

/*!< APB1 Secure peripherals */
#define TIM2_S              ((TIM_TypeDef *) TIM2_BASE_S)
#define TIM3_S              ((TIM_TypeDef *) TIM3_BASE_S)
#define TIM4_S              ((TIM_TypeDef *) TIM4_BASE_S)
#define TIM5_S              ((TIM_TypeDef *) TIM5_BASE_S)
#define TIM6_S              ((TIM_TypeDef *) TIM6_BASE_S)
#define TIM7_S              ((TIM_TypeDef *) TIM7_BASE_S)
#define RTC_S               ((RTC_TypeDef *) RTC_BASE_S)
#define WWDG_S              ((WWDG_TypeDef *) WWDG_BASE_S)
#define IWDG_S              ((IWDG_TypeDef *) IWDG_BASE_S)
#define TAMP_S              ((TAMP_TypeDef *) TAMP_BASE_S)
#define SPI2_S              ((SPI_TypeDef *) SPI2_BASE_S)
#define SPI3_S              ((SPI_TypeDef *) SPI3_BASE_S)
#define USART2_S            ((USART_TypeDef *) USART2_BASE_S)
#define USART3_S            ((USART_TypeDef *) USART3_BASE_S)
#define UART4_S             ((USART_TypeDef *) UART4_BASE_S)
#define UART5_S             ((USART_TypeDef *) UART5_BASE_S)
#define I2C1_S              ((I2C_TypeDef *) I2C1_BASE_S)
#define I2C2_S              ((I2C_TypeDef *) I2C2_BASE_S)
#define I2C3_S              ((I2C_TypeDef *) I2C3_BASE_S)
#define CRS_S               ((CRS_TypeDef *) CRS_BASE_S)
#define FDCAN1_S            ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_S)
#define FDCAN_CONFIG_S      ((FDCAN_Config_TypeDef *) FDCAN_CONFIG_BASE_S)
#define I2C4_S              ((I2C_TypeDef *) I2C4_BASE_S)
#define PWR_S               ((PWR_TypeDef *) PWR_BASE_S)
#define DAC_S               ((DAC_TypeDef *) DAC1_BASE_S)
#define DAC1_S              ((DAC_TypeDef *) DAC1_BASE_S)
#define OPAMP_S             ((OPAMP_TypeDef *) OPAMP_BASE_S)
#define OPAMP1_S            ((OPAMP_TypeDef *) OPAMP1_BASE_S)
#define OPAMP2_S            ((OPAMP_TypeDef *) OPAMP2_BASE_S)
#define OPAMP12_COMMON_S    ((OPAMP_Common_TypeDef *) OPAMP1_BASE_S)
#define LPTIM1_S            ((LPTIM_TypeDef *) LPTIM1_BASE_S)
#define LPUART1_S           ((USART_TypeDef *) LPUART1_BASE_S)
#define LPTIM2_S            ((LPTIM_TypeDef *) LPTIM2_BASE_S)
#define LPTIM3_S            ((LPTIM_TypeDef *) LPTIM3_BASE_S)
#define USB_S               ((USB_TypeDef *) USB_BASE_S)
#define UCPD1_S             ((UCPD_TypeDef *) UCPD1_BASE_S)

/*!< APB2 Secure peripherals */
#define SYSCFG_S            ((SYSCFG_TypeDef *) SYSCFG_BASE_S)
#define VREFBUF_S           ((VREFBUF_TypeDef *) VREFBUF_BASE_S)
#define COMP1_S             ((COMP_TypeDef *) COMP1_BASE_S)
#define COMP2_S             ((COMP_TypeDef *) COMP2_BASE_S)
#define COMP12_COMMON_S     ((COMP_Common_TypeDef *) COMP2_BASE_S)
#define TIM1_S              ((TIM_TypeDef *) TIM1_BASE_S)
#define SPI1_S              ((SPI_TypeDef *) SPI1_BASE_S)
#define TIM8_S              ((TIM_TypeDef *) TIM8_BASE_S)
#define USART1_S            ((USART_TypeDef *) USART1_BASE_S)
#define TIM15_S             ((TIM_TypeDef *) TIM15_BASE_S)
#define TIM16_S             ((TIM_TypeDef *) TIM16_BASE_S)
#define TIM17_S             ((TIM_TypeDef *) TIM17_BASE_S)
#define SAI1_S              ((SAI_TypeDef *) SAI1_BASE_S)
#define SAI1_Block_A_S      ((SAI_Block_TypeDef *)SAI1_Block_A_BASE_S)
#define SAI1_Block_B_S      ((SAI_Block_TypeDef *)SAI1_Block_B_BASE_S)
#define SAI2_S              ((SAI_TypeDef *) SAI2_BASE_S)
#define SAI2_Block_A_S      ((SAI_Block_TypeDef *)SAI2_Block_A_BASE_S)
#define SAI2_Block_B_S      ((SAI_Block_TypeDef *)SAI2_Block_B_BASE_S)
#define DFSDM1_Channel0_S   ((DFSDM_Channel_TypeDef *) DFSDM1_Channel0_BASE_S)
#define DFSDM1_Channel1_S   ((DFSDM_Channel_TypeDef *) DFSDM1_Channel1_BASE_S)
#define DFSDM1_Channel2_S   ((DFSDM_Channel_TypeDef *) DFSDM1_Channel2_BASE_S)
#define DFSDM1_Channel3_S   ((DFSDM_Channel_TypeDef *) DFSDM1_Channel3_BASE_S)
#define DFSDM1_Filter0_S    ((DFSDM_Filter_TypeDef *) DFSDM1_Filter0_BASE_S)
#define DFSDM1_Filter1_S    ((DFSDM_Filter_TypeDef *) DFSDM1_Filter1_BASE_S)
#define DFSDM1_Filter2_S    ((DFSDM_Filter_TypeDef *) DFSDM1_Filter2_BASE_S)
#define DFSDM1_Filter3_S    ((DFSDM_Filter_TypeDef *) DFSDM1_Filter3_BASE_S)

/*!< AHB1 Secure peripherals */
#define DMA1_S              ((DMA_TypeDef *) DMA1_BASE_S)
#define DMA2_S              ((DMA_TypeDef *) DMA2_BASE_S)
#define DMAMUX1_S           ((DMAMUX_Channel_TypeDef *) DMAMUX1_BASE_S)
#define RCC_S               ((RCC_TypeDef *) RCC_BASE_S)
#define FLASH_S             ((FLASH_TypeDef *) FLASH_R_BASE_S)
#define CRC_S               ((CRC_TypeDef *) CRC_BASE_S)
#define TSC_S               ((TSC_TypeDef *) TSC_BASE_S)
#define EXTI_S              ((EXTI_TypeDef *) EXTI_BASE_S)
#define ICACHE_S            ((ICACHE_TypeDef *) ICACHE_BASE_S)
#define GTZC_TZSC_S         ((GTZC_TZSC_TypeDef *) GTZC_TZSC_BASE_S)
#define GTZC_TZIC_S         ((GTZC_TZIC_TypeDef *) GTZC_TZIC_BASE_S)
#define GTZC_MPCBB2_S       ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB2_BASE_S)
#define GTZC_MPCBB1_S       ((GTZC_MPCBB_TypeDef *) GTZC_MPCBB1_BASE_S)

#define DMA1_Channel1_S     ((DMA_Channel_TypeDef *) DMA1_Channel1_BASE_S)
#define DMA1_Channel2_S     ((DMA_Channel_TypeDef *) DMA1_Channel2_BASE_S)
#define DMA1_Channel3_S     ((DMA_Channel_TypeDef *) DMA1_Channel3_BASE_S)
#define DMA1_Channel4_S     ((DMA_Channel_TypeDef *) DMA1_Channel4_BASE_S)
#define DMA1_Channel5_S     ((DMA_Channel_TypeDef *) DMA1_Channel5_BASE_S)
#define DMA1_Channel6_S     ((DMA_Channel_TypeDef *) DMA1_Channel6_BASE_S)
#define DMA1_Channel7_S     ((DMA_Channel_TypeDef *) DMA1_Channel7_BASE_S)
#define DMA1_Channel8_S     ((DMA_Channel_TypeDef *) DMA1_Channel8_BASE_S)

#define DMA2_Channel1_S     ((DMA_Channel_TypeDef *) DMA2_Channel1_BASE_S)
#define DMA2_Channel2_S     ((DMA_Channel_TypeDef *) DMA2_Channel2_BASE_S)
#define DMA2_Channel3_S     ((DMA_Channel_TypeDef *) DMA2_Channel3_BASE_S)
#define DMA2_Channel4_S     ((DMA_Channel_TypeDef *) DMA2_Channel4_BASE_S)
#define DMA2_Channel5_S     ((DMA_Channel_TypeDef *) DMA2_Channel5_BASE_S)
#define DMA2_Channel6_S     ((DMA_Channel_TypeDef *) DMA2_Channel6_BASE_S)
#define DMA2_Channel7_S     ((DMA_Channel_TypeDef *) DMA2_Channel7_BASE_S)
#define DMA2_Channel8_S     ((DMA_Channel_TypeDef *) DMA2_Channel8_BASE_S)

#define DMAMUX1_Channel0_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel0_BASE_S)
#define DMAMUX1_Channel1_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel1_BASE_S)
#define DMAMUX1_Channel2_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel2_BASE_S)
#define DMAMUX1_Channel3_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel3_BASE_S)
#define DMAMUX1_Channel4_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel4_BASE_S)
#define DMAMUX1_Channel5_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel5_BASE_S)
#define DMAMUX1_Channel6_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel6_BASE_S)
#define DMAMUX1_Channel7_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel7_BASE_S)
#define DMAMUX1_Channel8_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel8_BASE_S)
#define DMAMUX1_Channel9_S  ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel9_BASE_S)
#define DMAMUX1_Channel10_S ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel10_BASE_S)
#define DMAMUX1_Channel11_S ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel11_BASE_S)
#define DMAMUX1_Channel12_S ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel12_BASE_S)
#define DMAMUX1_Channel13_S ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel13_BASE_S)
#define DMAMUX1_Channel14_S ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel14_BASE_S)
#define DMAMUX1_Channel15_S ((DMAMUX_Channel_TypeDef *) DMAMUX1_Channel15_BASE_S)

#define DMAMUX1_RequestGenerator0_S  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator0_BASE_S)
#define DMAMUX1_RequestGenerator1_S  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator1_BASE_S)
#define DMAMUX1_RequestGenerator2_S  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator2_BASE_S)
#define DMAMUX1_RequestGenerator3_S  ((DMAMUX_RequestGen_TypeDef *) DMAMUX1_RequestGenerator3_BASE_S)

#define DMAMUX1_ChannelStatus_S      ((DMAMUX_ChannelStatus_TypeDef *) DMAMUX1_ChannelStatus_BASE_S)
#define DMAMUX1_RequestGenStatus_S   ((DMAMUX_RequestGenStatus_TypeDef *) DMAMUX1_RequestGenStatus_BASE_S)

/*!< AHB2 Secure peripherals */
#define GPIOA_S             ((GPIO_TypeDef *) GPIOA_BASE_S)
#define GPIOB_S             ((GPIO_TypeDef *) GPIOB_BASE_S)
#define GPIOC_S             ((GPIO_TypeDef *) GPIOC_BASE_S)
#define GPIOD_S             ((GPIO_TypeDef *) GPIOD_BASE_S)
#define GPIOE_S             ((GPIO_TypeDef *) GPIOE_BASE_S)
#define GPIOF_S             ((GPIO_TypeDef *) GPIOF_BASE_S)
#define GPIOG_S             ((GPIO_TypeDef *) GPIOG_BASE_S)
#define GPIOH_S             ((GPIO_TypeDef *) GPIOH_BASE_S)
#define ADC1_S              ((ADC_TypeDef *) ADC1_BASE_S)
#define ADC2_S              ((ADC_TypeDef *) ADC2_BASE_S)
#define ADC12_COMMON_S      ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_S)
#define HASH_S              ((HASH_TypeDef *) HASH_BASE_S)
#define HASH_DIGEST_S       ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_S)
#define RNG_S               ((RNG_TypeDef *) RNG_BASE_S)
#define SDMMC1_S            ((SDMMC_TypeDef *) SDMMC1_BASE_S)

/*!< AHB3 Secure peripherals */
#define FMC_Bank1_R_S       ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE_S)
#define FMC_Bank1E_R_S      ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE_S)
#define FMC_Bank3_R_S       ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE_S)

#define OCTOSPI1_S          ((OCTOSPI_TypeDef *) OCTOSPI1_R_BASE_S)


#define DBGMCU              ((DBGMCU_TypeDef *) DBGMCU_BASE)

