MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L552ZE/mcu.h
#define RCC_CCIPR1_I2C1SEL_Pos               (12U)
#define RCC_CCIPR1_I2C1SEL_Msk               (0x3UL << RCC_CCIPR1_I2C1SEL_Pos)  /*!< 0x00003000 */
#define RCC_CCIPR1_I2C1SEL                   RCC_CCIPR1_I2C1SEL_Msk
#define RCC_CCIPR1_I2C1SEL_0                 (0x1UL << RCC_CCIPR1_I2C1SEL_Pos)  /*!< 0x00001000 */
#define RCC_CCIPR1_I2C1SEL_1                 (0x2UL << RCC_CCIPR1_I2C1SEL_Pos)  /*!< 0x00002000 */

#define RCC_CCIPR1_I2C2SEL_Pos               (14U)
#define RCC_CCIPR1_I2C2SEL_Msk               (0x3UL << RCC_CCIPR1_I2C2SEL_Pos)  /*!< 0x0000C000 */
#define RCC_CCIPR1_I2C2SEL                   RCC_CCIPR1_I2C2SEL_Msk
#define RCC_CCIPR1_I2C2SEL_0                 (0x1UL << RCC_CCIPR1_I2C2SEL_Pos)  /*!< 0x00004000 */
#define RCC_CCIPR1_I2C2SEL_1                 (0x2UL << RCC_CCIPR1_I2C2SEL_Pos)  /*!< 0x00008000 */

#define RCC_CCIPR1_I2C3SEL_Pos               (16U)
#define RCC_CCIPR1_I2C3SEL_Msk               (0x3UL << RCC_CCIPR1_I2C3SEL_Pos)  /*!< 0x00030000 */
#define RCC_CCIPR1_I2C3SEL                   RCC_CCIPR1_I2C3SEL_Msk
#define RCC_CCIPR1_I2C3SEL_0                 (0x1UL << RCC_CCIPR1_I2C3SEL_Pos)  /*!< 0x00010000 */
#define RCC_CCIPR1_I2C3SEL_1                 (0x2UL << RCC_CCIPR1_I2C3SEL_Pos)  /*!< 0x00020000 */

#define RCC_CCIPR1_LPTIM1SEL_Pos             (18U)
#define RCC_CCIPR1_LPTIM1SEL_Msk             (0x3UL << RCC_CCIPR1_LPTIM1SEL_Pos)/*!< 0x000C0000 */
#define RCC_CCIPR1_LPTIM1SEL                 RCC_CCIPR1_LPTIM1SEL_Msk
#define RCC_CCIPR1_LPTIM1SEL_0               (0x1UL << RCC_CCIPR1_LPTIM1SEL_Pos)/*!< 0x00040000 */
#define RCC_CCIPR1_LPTIM1SEL_1               (0x2UL << RCC_CCIPR1_LPTIM1SEL_Pos)/*!< 0x00080000 */

#define RCC_CCIPR1_LPTIM2SEL_Pos             (20U)
#define RCC_CCIPR1_LPTIM2SEL_Msk             (0x3UL << RCC_CCIPR1_LPTIM2SEL_Pos)/*!< 0x00300000 */
#define RCC_CCIPR1_LPTIM2SEL                 RCC_CCIPR1_LPTIM2SEL_Msk
#define RCC_CCIPR1_LPTIM2SEL_0               (0x1UL << RCC_CCIPR1_LPTIM2SEL_Pos)/*!< 0x00100000 */
#define RCC_CCIPR1_LPTIM2SEL_1               (0x2UL << RCC_CCIPR1_LPTIM2SEL_Pos)/*!< 0x00200000 */

#define RCC_CCIPR1_LPTIM3SEL_Pos             (22U)
#define RCC_CCIPR1_LPTIM3SEL_Msk             (0x3UL << RCC_CCIPR1_LPTIM3SEL_Pos)/*!< 0x00C00000 */
#define RCC_CCIPR1_LPTIM3SEL                 RCC_CCIPR1_LPTIM3SEL_Msk
#define RCC_CCIPR1_LPTIM3SEL_0               (0x1UL << RCC_CCIPR1_LPTIM3SEL_Pos)/*!< 0x00400000 */
#define RCC_CCIPR1_LPTIM3SEL_1               (0x2UL << RCC_CCIPR1_LPTIM3SEL_Pos)/*!< 0x00800000 */

#define RCC_CCIPR1_FDCANSEL_Pos              (24U)
#define RCC_CCIPR1_FDCANSEL_Msk              (0x3UL << RCC_CCIPR1_FDCANSEL_Pos) /*!< 0x03000000 */
#define RCC_CCIPR1_FDCANSEL                  RCC_CCIPR1_FDCANSEL_Msk
#define RCC_CCIPR1_FDCANSEL_0                (0x1UL << RCC_CCIPR1_FDCANSEL_Pos) /*!< 0x01000000 */
#define RCC_CCIPR1_FDCANSEL_1                (0x2UL << RCC_CCIPR1_FDCANSEL_Pos) /*!< 0x02000000 */

#define RCC_CCIPR1_CLK48MSEL_Pos             (26U)
#define RCC_CCIPR1_CLK48MSEL_Msk             (0x3UL << RCC_CCIPR1_CLK48MSEL_Pos) /*!< 0x0C000000 */
#define RCC_CCIPR1_CLK48MSEL                 RCC_CCIPR1_CLK48MSEL_Msk
#define RCC_CCIPR1_CLK48MSEL_0               (0x1UL << RCC_CCIPR1_CLK48MSEL_Pos) /*!< 0x04000000 */
#define RCC_CCIPR1_CLK48MSEL_1               (0x2UL << RCC_CCIPR1_CLK48MSEL_Pos) /*!< 0x08000000 */

#define RCC_CCIPR1_ADCSEL_Pos                (28U)
#define RCC_CCIPR1_ADCSEL_Msk                (0x3UL << RCC_CCIPR1_ADCSEL_Pos)   /*!< 0x30000000 */
#define RCC_CCIPR1_ADCSEL                    RCC_CCIPR1_ADCSEL_Msk
#define RCC_CCIPR1_ADCSEL_0                  (0x1UL << RCC_CCIPR1_ADCSEL_Pos)   /*!< 0x10000000 */
#define RCC_CCIPR1_ADCSEL_1                  (0x2UL << RCC_CCIPR1_ADCSEL_Pos)   /*!< 0x20000000 */

/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos                   (0U)
#define RCC_BDCR_LSEON_Msk                   (0x1UL << RCC_BDCR_LSEON_Pos)     /*!< 0x00000001 */
#define RCC_BDCR_LSEON                       RCC_BDCR_LSEON_Msk
#define RCC_BDCR_LSERDY_Pos                  (1U)
#define RCC_BDCR_LSERDY_Msk                  (0x1UL << RCC_BDCR_LSERDY_Pos)    /*!< 0x00000002 */
#define RCC_BDCR_LSERDY                      RCC_BDCR_LSERDY_Msk
#define RCC_BDCR_LSEBYP_Pos                  (2U)
#define RCC_BDCR_LSEBYP_Msk                  (0x1UL << RCC_BDCR_LSEBYP_Pos)    /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP                      RCC_BDCR_LSEBYP_Msk

#define RCC_BDCR_LSEDRV_Pos                  (3U)
#define RCC_BDCR_LSEDRV_Msk                  (0x3UL << RCC_BDCR_LSEDRV_Pos)    /*!< 0x00000018 */
#define RCC_BDCR_LSEDRV                      RCC_BDCR_LSEDRV_Msk
#define RCC_BDCR_LSEDRV_0                    (0x1UL << RCC_BDCR_LSEDRV_Pos)    /*!< 0x00000008 */
#define RCC_BDCR_LSEDRV_1                    (0x2UL << RCC_BDCR_LSEDRV_Pos)    /*!< 0x00000010 */

#define RCC_BDCR_LSECSSON_Pos                (5U)
#define RCC_BDCR_LSECSSON_Msk                (0x1UL << RCC_BDCR_LSECSSON_Pos)  /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON                    RCC_BDCR_LSECSSON_Msk
#define RCC_BDCR_LSECSSD_Pos                 (6U)
#define RCC_BDCR_LSECSSD_Msk                 (0x1UL << RCC_BDCR_LSECSSD_Pos)   /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD                     RCC_BDCR_LSECSSD_Msk
#define RCC_BDCR_LSESYSEN_Pos                (7U)
#define RCC_BDCR_LSESYSEN_Msk                (0x1UL << RCC_BDCR_LSESYSEN_Pos)   /*!< 0x00000080 */
#define RCC_BDCR_LSESYSEN                    RCC_BDCR_LSESYSEN_Msk

#define RCC_BDCR_RTCSEL_Pos                  (8U)
#define RCC_BDCR_RTCSEL_Msk                  (0x3UL << RCC_BDCR_RTCSEL_Pos)    /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL                      RCC_BDCR_RTCSEL_Msk
#define RCC_BDCR_RTCSEL_0                    (0x1UL << RCC_BDCR_RTCSEL_Pos)    /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1                    (0x2UL << RCC_BDCR_RTCSEL_Pos)    /*!< 0x00000200 */

#define RCC_BDCR_LSESYSRDY_Pos               (11U)
#define RCC_BDCR_LSESYSRDY_Msk               (0x1UL << RCC_BDCR_LSESYSRDY_Pos) /*!< 0x00000800 */
#define RCC_BDCR_LSESYSRDY                   RCC_BDCR_LSESYSRDY_Msk
#define RCC_BDCR_RTCEN_Pos                   (15U)
#define RCC_BDCR_RTCEN_Msk                   (0x1UL << RCC_BDCR_RTCEN_Pos)     /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                       RCC_BDCR_RTCEN_Msk
#define RCC_BDCR_BDRST_Pos                   (16U)
#define RCC_BDCR_BDRST_Msk                   (0x1UL << RCC_BDCR_BDRST_Pos)     /*!< 0x00010000 */
#define RCC_BDCR_BDRST                       RCC_BDCR_BDRST_Msk
#define RCC_BDCR_LSCOEN_Pos                  (24U)
#define RCC_BDCR_LSCOEN_Msk                  (0x1UL << RCC_BDCR_LSCOEN_Pos)    /*!< 0x01000000 */
#define RCC_BDCR_LSCOEN                      RCC_BDCR_LSCOEN_Msk
#define RCC_BDCR_LSCOSEL_Pos                 (25U)
#define RCC_BDCR_LSCOSEL_Msk                 (0x1UL << RCC_BDCR_LSCOSEL_Pos)   /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                     RCC_BDCR_LSCOSEL_Msk

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos                    (0U)
#define RCC_CSR_LSION_Msk                    (0x1UL << RCC_CSR_LSION_Pos)      /*!< 0x00000001 */
#define RCC_CSR_LSION                        RCC_CSR_LSION_Msk
#define RCC_CSR_LSIRDY_Pos                   (1U)
#define RCC_CSR_LSIRDY_Msk                   (0x1UL << RCC_CSR_LSIRDY_Pos)     /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                       RCC_CSR_LSIRDY_Msk
#define RCC_CSR_LSIPRE_Pos                   (4U)
#define RCC_CSR_LSIPRE_Msk                   (0x1UL << RCC_CSR_LSIPRE_Pos)     /*!< 0x00000010 */
#define RCC_CSR_LSIPRE                       RCC_CSR_LSIPRE_Msk

#define RCC_CSR_MSISRANGE_Pos                (8U)
#define RCC_CSR_MSISRANGE_Msk                (0xFUL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000F00 */
#define RCC_CSR_MSISRANGE                    RCC_CSR_MSISRANGE_Msk
#define RCC_CSR_MSISRANGE_0                  (0x1UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000100 */
#define RCC_CSR_MSISRANGE_1                  (0x2UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000200 */
#define RCC_CSR_MSISRANGE_2                  (0x4UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000400 */
#define RCC_CSR_MSISRANGE_3                  (0x8UL << RCC_CSR_MSISRANGE_Pos)  /*!< 0x00000800 */

#define RCC_CSR_RMVF_Pos                     (23U)
#define RCC_CSR_RMVF_Msk                     (0x1UL << RCC_CSR_RMVF_Pos)       /*!< 0x00800000 */
#define RCC_CSR_RMVF                         RCC_CSR_RMVF_Msk
#define RCC_CSR_OBLRSTF_Pos                  (25U)
#define RCC_CSR_OBLRSTF_Msk                  (0x1UL << RCC_CSR_OBLRSTF_Pos)    /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                      RCC_CSR_OBLRSTF_Msk
#define RCC_CSR_PINRSTF_Pos                  (26U)
#define RCC_CSR_PINRSTF_Msk                  (0x1UL << RCC_CSR_PINRSTF_Pos)    /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                      RCC_CSR_PINRSTF_Msk
#define RCC_CSR_BORRSTF_Pos                  (27U)
#define RCC_CSR_BORRSTF_Msk                  (0x1UL << RCC_CSR_BORRSTF_Pos)    /*!< 0x08000000 */
#define RCC_CSR_BORRSTF                      RCC_CSR_BORRSTF_Msk
#define RCC_CSR_SFTRSTF_Pos                  (28U)
#define RCC_CSR_SFTRSTF_Msk                  (0x1UL << RCC_CSR_SFTRSTF_Pos)    /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                      RCC_CSR_SFTRSTF_Msk
#define RCC_CSR_IWDGRSTF_Pos                 (29U)
#define RCC_CSR_IWDGRSTF_Msk                 (0x1UL << RCC_CSR_IWDGRSTF_Pos)   /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                     RCC_CSR_IWDGRSTF_Msk
#define RCC_CSR_WWDGRSTF_Pos                 (30U)
#define RCC_CSR_WWDGRSTF_Msk                 (0x1UL << RCC_CSR_WWDGRSTF_Pos)   /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                     RCC_CSR_WWDGRSTF_Msk
#define RCC_CSR_LPWRRSTF_Pos                 (31U)
#define RCC_CSR_LPWRRSTF_Msk                 (0x1UL << RCC_CSR_LPWRRSTF_Pos)   /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF                     RCC_CSR_LPWRRSTF_Msk

/********************  Bit definition for RCC_CRRCR register  *****************/
#define RCC_CRRCR_HSI48ON_Pos                (0U)
#define RCC_CRRCR_HSI48ON_Msk                (0x1UL << RCC_CRRCR_HSI48ON_Pos)  /*!< 0x00000001 */
#define RCC_CRRCR_HSI48ON                    RCC_CRRCR_HSI48ON_Msk
#define RCC_CRRCR_HSI48RDY_Pos               (1U)
#define RCC_CRRCR_HSI48RDY_Msk               (0x1UL << RCC_CRRCR_HSI48RDY_Pos) /*!< 0x00000002 */
#define RCC_CRRCR_HSI48RDY                   RCC_CRRCR_HSI48RDY_Msk

/*!< HSI48CAL configuration */
#define RCC_CRRCR_HSI48CAL_Pos               (7U)
#define RCC_CRRCR_HSI48CAL_Msk               (0x1FFUL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x0000FF80 */
#define RCC_CRRCR_HSI48CAL                   RCC_CRRCR_HSI48CAL_Msk             /*!< HSI48CAL[8:0] bits */
#define RCC_CRRCR_HSI48CAL_0                 (0x001UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_1                 (0x002UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00000100 */
#define RCC_CRRCR_HSI48CAL_2                 (0x004UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00000200 */
#define RCC_CRRCR_HSI48CAL_3                 (0x008UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00000400 */
#define RCC_CRRCR_HSI48CAL_4                 (0x010UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00000800 */
#define RCC_CRRCR_HSI48CAL_5                 (0x020UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00001000 */
#define RCC_CRRCR_HSI48CAL_6                 (0x040UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00002000 */
#define RCC_CRRCR_HSI48CAL_7                 (0x080UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00004000 */
#define RCC_CRRCR_HSI48CAL_8                 (0x100UL << RCC_CRRCR_HSI48CAL_Pos)/*!< 0x00008000 */

/********************  Bit definition for RCC_CCIPR2 register  ******************/
#define RCC_CCIPR2_I2C4SEL_Pos               (0U)
#define RCC_CCIPR2_I2C4SEL_Msk               (0x3UL << RCC_CCIPR2_I2C4SEL_Pos) /*!< 0x00000003 */
#define RCC_CCIPR2_I2C4SEL                   RCC_CCIPR2_I2C4SEL_Msk
#define RCC_CCIPR2_I2C4SEL_0                 (0x1UL << RCC_CCIPR2_I2C4SEL_Pos) /*!< 0x00000001 */
#define RCC_CCIPR2_I2C4SEL_1                 (0x2UL << RCC_CCIPR2_I2C4SEL_Pos) /*!< 0x00000002 */

#define RCC_CCIPR2_DFSDMSEL_Pos              (2U)
#define RCC_CCIPR2_DFSDMSEL_Msk              (0x1UL << RCC_CCIPR2_DFSDMSEL_Pos)/*!< 0x00000004 */
#define RCC_CCIPR2_DFSDMSEL                  RCC_CCIPR2_DFSDMSEL_Msk

#define RCC_CCIPR2_ADFSDMSEL_Pos             (3U)
#define RCC_CCIPR2_ADFSDMSEL_Msk             (0x3UL << RCC_CCIPR2_ADFSDMSEL_Pos)/*!< 0x00000018 */
#define RCC_CCIPR2_ADFSDMSEL                 RCC_CCIPR2_ADFSDMSEL_Msk
#define RCC_CCIPR2_ADFSDMSEL_0               (0x1UL << RCC_CCIPR2_ADFSDMSEL_Pos)/*!< 0x00000008 */
#define RCC_CCIPR2_ADFSDMSEL_1               (0x2UL << RCC_CCIPR2_ADFSDMSEL_Pos)/*!< 0x00000010 */

#define RCC_CCIPR2_SAI1SEL_Pos               (5U)
#define RCC_CCIPR2_SAI1SEL_Msk               (0x7UL << RCC_CCIPR2_SAI1SEL_Pos) /*!< 0x000000E0 */
#define RCC_CCIPR2_SAI1SEL                   RCC_CCIPR2_SAI1SEL_Msk
#define RCC_CCIPR2_SAI1SEL_0                 (0x1UL << RCC_CCIPR2_SAI1SEL_Pos) /*!< 0x00000020 */
#define RCC_CCIPR2_SAI1SEL_1                 (0x2UL << RCC_CCIPR2_SAI1SEL_Pos) /*!< 0x00000040 */
#define RCC_CCIPR2_SAI1SEL_2                 (0x4UL << RCC_CCIPR2_SAI1SEL_Pos) /*!< 0x00000080 */

#define RCC_CCIPR2_SAI2SEL_Pos               (8U)
#define RCC_CCIPR2_SAI2SEL_Msk               (0x7UL << RCC_CCIPR2_SAI2SEL_Pos) /*!< 0x00000700 */
#define RCC_CCIPR2_SAI2SEL                   RCC_CCIPR2_SAI2SEL_Msk
#define RCC_CCIPR2_SAI2SEL_0                 (0x1UL << RCC_CCIPR2_SAI2SEL_Pos) /*!< 0x00000100 */
#define RCC_CCIPR2_SAI2SEL_1                 (0x2UL << RCC_CCIPR2_SAI2SEL_Pos) /*!< 0x00000200 */
#define RCC_CCIPR2_SAI2SEL_2                 (0x4UL << RCC_CCIPR2_SAI2SEL_Pos) /*!< 0x00000400 */

#define RCC_CCIPR2_SDMMCSEL_Pos              (14U)
#define RCC_CCIPR2_SDMMCSEL_Msk              (0x1UL << RCC_CCIPR2_SDMMCSEL_Pos)/*!< 0x00004000 */
#define RCC_CCIPR2_SDMMCSEL                  RCC_CCIPR2_SDMMCSEL_Msk

#define RCC_CCIPR2_OSPISEL_Pos               (20U)
#define RCC_CCIPR2_OSPISEL_Msk               (0x3UL << RCC_CCIPR2_OSPISEL_Pos)/*!< 0x00300000 */
#define RCC_CCIPR2_OSPISEL                   RCC_CCIPR2_OSPISEL_Msk
#define RCC_CCIPR2_OSPISEL_0                 (0x1UL << RCC_CCIPR2_OSPISEL_Pos)/*!< 0x00100000 */
#define RCC_CCIPR2_OSPISEL_1                 (0x2UL << RCC_CCIPR2_OSPISEL_Pos)/*!< 0x00200000 */

/********************  Bit definition for RCC_SECCFGR register  ***************/
#define RCC_SECCFGR_HSISEC_Pos               (0U)
#define RCC_SECCFGR_HSISEC_Msk               (0x1UL << RCC_SECCFGR_HSISEC_Pos)  /*!< 0x00000001 */
#define RCC_SECCFGR_HSISEC                   RCC_SECCFGR_HSISEC_Msk
#define RCC_SECCFGR_HSESEC_Pos               (1U)
#define RCC_SECCFGR_HSESEC_Msk               (0x1UL << RCC_SECCFGR_HSESEC_Pos)  /*!< 0x00000002 */
#define RCC_SECCFGR_HSESEC                   RCC_SECCFGR_HSESEC_Msk
#define RCC_SECCFGR_MSISEC_Pos               (2U)
#define RCC_SECCFGR_MSISEC_Msk               (0x1UL << RCC_SECCFGR_MSISEC_Pos)  /*!< 0x00000004 */
#define RCC_SECCFGR_MSISEC                   RCC_SECCFGR_MSISEC_Msk
#define RCC_SECCFGR_LSISEC_Pos               (3U)
#define RCC_SECCFGR_LSISEC_Msk               (0x1UL << RCC_SECCFGR_LSISEC_Pos)  /*!< 0x00000008 */
#define RCC_SECCFGR_LSISEC                   RCC_SECCFGR_LSISEC_Msk
#define RCC_SECCFGR_LSESEC_Pos               (4U)
#define RCC_SECCFGR_LSESEC_Msk               (0x1UL << RCC_SECCFGR_LSESEC_Pos)  /*!< 0x00000010 */
#define RCC_SECCFGR_LSESEC                   RCC_SECCFGR_LSESEC_Msk
#define RCC_SECCFGR_SYSCLKSEC_Pos            (5U)
#define RCC_SECCFGR_SYSCLKSEC_Msk            (0x1UL << RCC_SECCFGR_SYSCLKSEC_Pos)/*!< 0x00000020 */
#define RCC_SECCFGR_SYSCLKSEC                RCC_SECCFGR_SYSCLKSEC_Msk
#define RCC_SECCFGR_PRESCSEC_Pos             (6U)
#define RCC_SECCFGR_PRESCSEC_Msk             (0x1UL << RCC_SECCFGR_PRESCSEC_Pos)/*!< 0x00000040 */
#define RCC_SECCFGR_PRESCSEC                 RCC_SECCFGR_PRESCSEC_Msk
#define RCC_SECCFGR_PLLSEC_Pos               (7U)
#define RCC_SECCFGR_PLLSEC_Msk               (0x1UL << RCC_SECCFGR_PLLSEC_Pos)/*!< 0x00000080 */
#define RCC_SECCFGR_PLLSEC                   RCC_SECCFGR_PLLSEC_Msk
#define RCC_SECCFGR_PLLSAI1SEC_Pos           (8U)
#define RCC_SECCFGR_PLLSAI1SEC_Msk           (0x1UL << RCC_SECCFGR_PLLSAI1SEC_Pos)/*!< 0x00000100 */
#define RCC_SECCFGR_PLLSAI1SEC               RCC_SECCFGR_PLLSAI1SEC_Msk
#define RCC_SECCFGR_PLLSAI2SEC_Pos           (9U)
#define RCC_SECCFGR_PLLSAI2SEC_Msk           (0x1UL << RCC_SECCFGR_PLLSAI2SEC_Pos)/*!< 0x00000200 */
#define RCC_SECCFGR_PLLSAI2SEC               RCC_SECCFGR_PLLSAI2SEC_Msk
#define RCC_SECCFGR_CLK48MSEC_Pos            (10U)
#define RCC_SECCFGR_CLK48MSEC_Msk            (0x1UL << RCC_SECCFGR_CLK48MSEC_Pos) /*!< 0x00000400 */
#define RCC_SECCFGR_CLK48MSEC                RCC_SECCFGR_CLK48MSEC_Msk
#define RCC_SECCFGR_HSI48SEC_Pos             (11U)
#define RCC_SECCFGR_HSI48SEC_Msk             (0x1UL << RCC_SECCFGR_HSI48SEC_Pos)  /*!< 0x00000800 */
#define RCC_SECCFGR_HSI48SEC                 RCC_SECCFGR_HSI48SEC_Msk
#define RCC_SECCFGR_RMVFSEC_Pos              (12U)
#define RCC_SECCFGR_RMVFSEC_Msk              (0x1UL << RCC_SECCFGR_RMVFSEC_Pos)/*!< 0x00001000 */
#define RCC_SECCFGR_RMVFSEC                  RCC_SECCFGR_RMVFSEC_Msk

/********************  Bit definition for RCC_SECSR register  *****************/
#define RCC_SECSR_HSISECF_Pos                (0U)
#define RCC_SECSR_HSISECF_Msk                (0x1UL << RCC_SECSR_HSISECF_Pos)  /*!< 0x00000001 */
#define RCC_SECSR_HSISECF                    RCC_SECSR_HSISECF_Msk
#define RCC_SECSR_HSESECF_Pos                (1U)
#define RCC_SECSR_HSESECF_Msk                (0x1UL << RCC_SECSR_HSESECF_Pos)  /*!< 0x00000002 */
#define RCC_SECSR_HSESECF                    RCC_SECSR_HSESECF_Msk
#define RCC_SECSR_MSISECF_Pos                (2U)
#define RCC_SECSR_MSISECF_Msk                (0x1UL << RCC_SECSR_MSISECF_Pos)  /*!< 0x00000004 */
#define RCC_SECSR_MSISECF                    RCC_SECSR_MSISECF_Msk
#define RCC_SECSR_LSISECF_Pos                (3U)
#define RCC_SECSR_LSISECF_Msk                (0x1UL << RCC_SECSR_LSISECF_Pos)  /*!< 0x00000008 */
#define RCC_SECSR_LSISECF                    RCC_SECSR_LSISECF_Msk
#define RCC_SECSR_LSESECF_Pos                (4U)
#define RCC_SECSR_LSESECF_Msk                (0x1UL << RCC_SECSR_LSESECF_Pos)  /*!< 0x00000010 */
#define RCC_SECSR_LSESECF                    RCC_SECSR_LSESECF_Msk
#define RCC_SECSR_SYSCLKSECF_Pos             (5U)
#define RCC_SECSR_SYSCLKSECF_Msk             (0x1UL << RCC_SECSR_SYSCLKSECF_Pos)/*!< 0x00000020 */
#define RCC_SECSR_SYSCLKSECF                 RCC_SECSR_SYSCLKSECF_Msk
#define RCC_SECSR_PRESCSECF_Pos              (6U)
#define RCC_SECSR_PRESCSECF_Msk              (0x1UL << RCC_SECSR_PRESCSECF_Pos)/*!< 0x00000040 */
#define RCC_SECSR_PRESCSECF                  RCC_SECSR_PRESCSECF_Msk
#define RCC_SECSR_PLLSECF_Pos                (7U)
#define RCC_SECSR_PLLSECF_Msk                (0x1UL << RCC_SECSR_PLLSECF_Pos)  /*!< 0x00000080 */
#define RCC_SECSR_PLLSECF                    RCC_SECSR_PLLSECF_Msk
#define RCC_SECSR_PLLSAI1SECF_Pos            (8U)
#define RCC_SECSR_PLLSAI1SECF_Msk            (0x1UL << RCC_SECSR_PLLSAI1SECF_Pos)/*!< 0x00000100 */
#define RCC_SECSR_PLLSAI1SECF                RCC_SECSR_PLLSAI1SECF_Msk
#define RCC_SECSR_PLLSAI2SECF_Pos            (9U)
#define RCC_SECSR_PLLSAI2SECF_Msk            (0x1UL << RCC_SECSR_PLLSAI2SECF_Pos)/*!< 0x00000200 */
#define RCC_SECSR_PLLSAI2SECF                RCC_SECSR_PLLSAI2SECF_Msk
#define RCC_SECSR_CLK48MSECF_Pos             (10U)
#define RCC_SECSR_CLK48MSECF_Msk             (0x1UL << RCC_SECSR_CLK48MSECF_Pos) /*!< 0x00000400 */
#define RCC_SECSR_CLK48MSECF                 RCC_SECSR_CLK48MSECF_Msk
#define RCC_SECSR_HSI48SECF_Pos              (11U)
#define RCC_SECSR_HSI48SECF_Msk              (0x1UL << RCC_SECSR_HSI48SECF_Pos)  /*!< 0x00000800 */
#define RCC_SECSR_HSI48SECF                  RCC_SECSR_HSI48SECF_Msk
#define RCC_SECSR_RMVFSECF_Pos               (12U)
#define RCC_SECSR_RMVFSECF_Msk               (0x1UL << RCC_SECSR_RMVFSECF_Pos)/*!< 0x00001000 */
#define RCC_SECSR_RMVFSECF                   RCC_SECSR_RMVFSECF_Msk

/********************  Bit definition for RCC_AHB1SECSR register  *************/
#define RCC_AHB1SECSR_DMA1SECF_Pos           (0U)
#define RCC_AHB1SECSR_DMA1SECF_Msk           (0x1UL << RCC_AHB1SECSR_DMA1SECF_Pos)/*!< 0x00000001 */
#define RCC_AHB1SECSR_DMA1SECF               RCC_AHB1SECSR_DMA1SECF_Msk
#define RCC_AHB1SECSR_DMA2SECF_Pos           (1U)
#define RCC_AHB1SECSR_DMA2SECF_Msk           (0x1UL << RCC_AHB1SECSR_DMA2SECF_Pos)/*!< 0x00000002 */
#define RCC_AHB1SECSR_DMA2SECF               RCC_AHB1SECSR_DMA2SECF_Msk
#define RCC_AHB1SECSR_DMAMUX1SECF_Pos        (2U)
#define RCC_AHB1SECSR_DMAMUX1SECF_Msk        (0x1UL << RCC_AHB1SECSR_DMAMUX1SECF_Pos)/*!< 0x00000004 */
#define RCC_AHB1SECSR_DMAMUX1SECF            RCC_AHB1SECSR_DMAMUX1SECF_Msk
#define RCC_AHB1SECSR_FLASHSECF_Pos          (8U)
#define RCC_AHB1SECSR_FLASHSECF_Msk          (0x1UL << RCC_AHB1SECSR_FLASHSECF_Pos)/*!< 0x00000100 */
#define RCC_AHB1SECSR_FLASHSECF              RCC_AHB1SECSR_FLASHSECF_Msk
#define RCC_AHB1SECSR_SRAM1SECF_Pos          (9U)
#define RCC_AHB1SECSR_SRAM1SECF_Msk          (0x1UL << RCC_AHB1SECSR_SRAM1SECF_Pos)/*!< 0x00000200 */
#define RCC_AHB1SECSR_SRAM1SECF              RCC_AHB1SECSR_SRAM1SECF_Msk
#define RCC_AHB1SECSR_CRCSECF_Pos            (12U)
#define RCC_AHB1SECSR_CRCSECF_Msk            (0x1UL << RCC_AHB1SECSR_CRCSECF_Pos)/*!< 0x00001000 */
#define RCC_AHB1SECSR_CRCSECF                RCC_AHB1SECSR_CRCSECF_Msk
#define RCC_AHB1SECSR_TSCSECF_Pos            (16U)
#define RCC_AHB1SECSR_TSCSECF_Msk            (0x1UL << RCC_AHB1SECSR_TSCSECF_Pos)/*!< 0x00010000 */
#define RCC_AHB1SECSR_TSCSECF                RCC_AHB1SECSR_TSCSECF_Msk
#define RCC_AHB1SECSR_GTZCSECF_Pos           (22U)
#define RCC_AHB1SECSR_GTZCSECF_Msk           (0x1UL << RCC_AHB1SECSR_GTZCSECF_Pos)/*!< 0x00400000 */
#define RCC_AHB1SECSR_GTZCSECF               RCC_AHB1SECSR_GTZCSECF_Msk
#define RCC_AHB1SECSR_ICACHESECF_Pos         (23U)
#define RCC_AHB1SECSR_ICACHESECF_Msk         (0x1UL << RCC_AHB1SECSR_ICACHESECF_Pos)/*!< 0x00600000 */
#define RCC_AHB1SECSR_ICACHESECF             RCC_AHB1SECSR_ICACHESECF_Msk

