MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L552ZE/mcu.h
#define TIM1_OR1_TI1_RMP_Pos      (4U)
#define TIM1_OR1_TI1_RMP_Msk      (0x1UL << TIM1_OR1_TI1_RMP_Pos)              /*!< 0x00000010 */
#define TIM1_OR1_TI1_RMP          TIM1_OR1_TI1_RMP_Msk                         /*!<TIM1 Input Capture 1 remap */

/*******************  Bit definition for TIM1_OR2 register  *******************/
#define TIM1_OR2_BKINE_Pos        (0U)
#define TIM1_OR2_BKINE_Msk        (0x1UL << TIM1_OR2_BKINE_Pos)                /*!< 0x00000001 */
#define TIM1_OR2_BKINE            TIM1_OR2_BKINE_Msk                           /*!<BRK BKIN input enable */
#define TIM1_OR2_BKCMP1E_Pos      (1U)
#define TIM1_OR2_BKCMP1E_Msk      (0x1UL << TIM1_OR2_BKCMP1E_Pos)              /*!< 0x00000002 */
#define TIM1_OR2_BKCMP1E          TIM1_OR2_BKCMP1E_Msk                         /*!<BRK COMP1 enable */
#define TIM1_OR2_BKCMP2E_Pos      (2U)
#define TIM1_OR2_BKCMP2E_Msk      (0x1UL << TIM1_OR2_BKCMP2E_Pos)              /*!< 0x00000004 */
#define TIM1_OR2_BKCMP2E          TIM1_OR2_BKCMP2E_Msk                         /*!<BRK COMP2 enable */
#define TIM1_OR2_BKDF1BK0E_Pos    (8U)
#define TIM1_OR2_BKDF1BK0E_Msk    (0x1UL << TIM1_OR2_BKDF1BK0E_Pos)            /*!< 0x00000100 */
#define TIM1_OR2_BKDF1BK0E        TIM1_OR2_BKDF1BK0E_Msk                       /*!<BRK DFSDM1_BREAK[0] enable */
#define TIM1_OR2_BKINP_Pos        (9U)
#define TIM1_OR2_BKINP_Msk        (0x1UL << TIM1_OR2_BKINP_Pos)                /*!< 0x00000200 */
#define TIM1_OR2_BKINP            TIM1_OR2_BKINP_Msk                           /*!<BRK BKIN input polarity */
#define TIM1_OR2_BKCMP1P_Pos      (10U)
#define TIM1_OR2_BKCMP1P_Msk      (0x1UL << TIM1_OR2_BKCMP1P_Pos)              /*!< 0x00000400 */
#define TIM1_OR2_BKCMP1P          TIM1_OR2_BKCMP1P_Msk                         /*!<BRK COMP1 input polarity */
#define TIM1_OR2_BKCMP2P_Pos      (11U)
#define TIM1_OR2_BKCMP2P_Msk      (0x1UL << TIM1_OR2_BKCMP2P_Pos)              /*!< 0x00000800 */
#define TIM1_OR2_BKCMP2P          TIM1_OR2_BKCMP2P_Msk                         /*!<BRK COMP2 input polarity */

#define TIM1_OR2_ETRSEL_Pos       (14U)
#define TIM1_OR2_ETRSEL_Msk       (0x7UL << TIM1_OR2_ETRSEL_Pos)               /*!< 0x0001C000 */
#define TIM1_OR2_ETRSEL           TIM1_OR2_ETRSEL_Msk                          /*!<ETRSEL[2:0] bits (TIM1 ETR source selection) */
#define TIM1_OR2_ETRSEL_0         (0x1UL << TIM1_OR2_ETRSEL_Pos)               /*!< 0x00004000 */
#define TIM1_OR2_ETRSEL_1         (0x2UL << TIM1_OR2_ETRSEL_Pos)               /*!< 0x00008000 */
#define TIM1_OR2_ETRSEL_2         (0x4UL << TIM1_OR2_ETRSEL_Pos)               /*!< 0x00010000 */

/*******************  Bit definition for TIM1_OR3 register  *******************/
#define TIM1_OR3_BK2INE_Pos       (0U)
#define TIM1_OR3_BK2INE_Msk       (0x1UL << TIM1_OR3_BK2INE_Pos)               /*!< 0x00000001 */
#define TIM1_OR3_BK2INE           TIM1_OR3_BK2INE_Msk                          /*!<BRK2 BKIN2 input enable */
#define TIM1_OR3_BK2CMP1E_Pos     (1U)
#define TIM1_OR3_BK2CMP1E_Msk     (0x1UL << TIM1_OR3_BK2CMP1E_Pos)             /*!< 0x00000002 */
#define TIM1_OR3_BK2CMP1E         TIM1_OR3_BK2CMP1E_Msk                        /*!<BRK2 COMP1 enable */
#define TIM1_OR3_BK2CMP2E_Pos     (2U)
#define TIM1_OR3_BK2CMP2E_Msk     (0x1UL << TIM1_OR3_BK2CMP2E_Pos)             /*!< 0x00000004 */
#define TIM1_OR3_BK2CMP2E         TIM1_OR3_BK2CMP2E_Msk                        /*!<BRK2 COMP2 enable */
#define TIM1_OR3_BK2DF1BK1E_Pos   (8U)
#define TIM1_OR3_BK2DF1BK1E_Msk   (0x1UL << TIM1_OR3_BK2DF1BK1E_Pos)           /*!< 0x00000100 */
#define TIM1_OR3_BK2DF1BK1E       TIM1_OR3_BK2DF1BK1E_Msk                      /*!<BRK2 DFSDM1_BREAK[1] enable */
#define TIM1_OR3_BK2INP_Pos       (9U)
#define TIM1_OR3_BK2INP_Msk       (0x1UL << TIM1_OR3_BK2INP_Pos)               /*!< 0x00000200 */
#define TIM1_OR3_BK2INP           TIM1_OR3_BK2INP_Msk                          /*!<BRK2 BKIN2 input polarity */
#define TIM1_OR3_BK2CMP1P_Pos     (10U)
#define TIM1_OR3_BK2CMP1P_Msk     (0x1UL << TIM1_OR3_BK2CMP1P_Pos)             /*!< 0x00000400 */
#define TIM1_OR3_BK2CMP1P         TIM1_OR3_BK2CMP1P_Msk                        /*!<BRK2 COMP1 input polarity */
#define TIM1_OR3_BK2CMP2P_Pos     (11U)
#define TIM1_OR3_BK2CMP2P_Msk     (0x1UL << TIM1_OR3_BK2CMP2P_Pos)             /*!< 0x00000800 */
#define TIM1_OR3_BK2CMP2P         TIM1_OR3_BK2CMP2P_Msk                        /*!<BRK2 COMP2 input polarity */

/*******************  Bit definition for TIM8_OR1 register  *******************/
#define TIM8_OR1_TI1_RMP_Pos      (4U)
#define TIM8_OR1_TI1_RMP_Msk      (0x1UL << TIM8_OR1_TI1_RMP_Pos)              /*!< 0x00000010 */
#define TIM8_OR1_TI1_RMP          TIM8_OR1_TI1_RMP_Msk                         /*!<TIM8 Input Capture 1 remap */

/*******************  Bit definition for TIM8_OR2 register  *******************/
#define TIM8_OR2_BKINE_Pos        (0U)
#define TIM8_OR2_BKINE_Msk        (0x1UL << TIM8_OR2_BKINE_Pos)                /*!< 0x00000001 */
#define TIM8_OR2_BKINE            TIM8_OR2_BKINE_Msk                           /*!<BRK BKIN input enable */
#define TIM8_OR2_BKCMP1E_Pos      (1U)
#define TIM8_OR2_BKCMP1E_Msk      (0x1UL << TIM8_OR2_BKCMP1E_Pos)              /*!< 0x00000002 */
#define TIM8_OR2_BKCMP1E          TIM8_OR2_BKCMP1E_Msk                         /*!<BRK COMP1 enable */
#define TIM8_OR2_BKCMP2E_Pos      (2U)
#define TIM8_OR2_BKCMP2E_Msk      (0x1UL << TIM8_OR2_BKCMP2E_Pos)              /*!< 0x00000004 */
#define TIM8_OR2_BKCMP2E          TIM8_OR2_BKCMP2E_Msk                         /*!<BRK COMP2 enable */
#define TIM8_OR2_BKDF1BK2E_Pos    (8U)
#define TIM8_OR2_BKDF1BK2E_Msk    (0x1UL << TIM8_OR2_BKDF1BK2E_Pos)            /*!< 0x00000100 */
#define TIM8_OR2_BKDF1BK2E        TIM8_OR2_BKDF1BK2E_Msk                       /*!<BRK DFSDM1_BREAK[2] enable */
#define TIM8_OR2_BKINP_Pos        (9U)
#define TIM8_OR2_BKINP_Msk        (0x1UL << TIM8_OR2_BKINP_Pos)                /*!< 0x00000200 */
#define TIM8_OR2_BKINP            TIM8_OR2_BKINP_Msk                           /*!<BRK BKIN input polarity */
#define TIM8_OR2_BKCMP1P_Pos      (10U)
#define TIM8_OR2_BKCMP1P_Msk      (0x1UL << TIM8_OR2_BKCMP1P_Pos)              /*!< 0x00000400 */
#define TIM8_OR2_BKCMP1P          TIM8_OR2_BKCMP1P_Msk                         /*!<BRK COMP1 input polarity */
#define TIM8_OR2_BKCMP2P_Pos      (11U)
#define TIM8_OR2_BKCMP2P_Msk      (0x1UL << TIM8_OR2_BKCMP2P_Pos)              /*!< 0x00000800 */
#define TIM8_OR2_BKCMP2P          TIM8_OR2_BKCMP2P_Msk                         /*!<BRK COMP2 input polarity */

