MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L552ZE/mcu.h
/****** TIM Instances : Master mode available (TIMx_CR2.MMS available )********/
#define IS_TIM_MASTER_INSTANCE(INSTANCE)   (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM4_S)  || \
                                            ((INSTANCE) == TIM5_S)  || \
                                            ((INSTANCE) == TIM6_S)  || \
                                            ((INSTANCE) == TIM7_S)  || \
                                            ((INSTANCE) == TIM8_S)  || \
                                            ((INSTANCE) == TIM15_S))

/*********** TIM Instances : Slave mode available (TIMx_SMCR available )*******/
#define IS_TIM_SLAVE_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM4_S)  || \
                                            ((INSTANCE) == TIM5_S)  || \
                                            ((INSTANCE) == TIM8_S)  || \
                                            ((INSTANCE) == TIM15_S))

/****************** TIM Instances : supporting OCxREF clear *******************/
#define IS_TIM_OCXREF_CLEAR_INSTANCE(INSTANCE)        (((INSTANCE) == TIM1_S)  || \
                                                       ((INSTANCE) == TIM2_S)  || \
                                                       ((INSTANCE) == TIM3_S)  || \
                                                       ((INSTANCE) == TIM4_S)  || \
                                                       ((INSTANCE) == TIM5_S)  || \
                                                       ((INSTANCE) == TIM8_S))

/****************** TIM Instances : remapping capability **********************/
#define IS_TIM_REMAP_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM8_S)  || \
                                            ((INSTANCE) == TIM15_S) || \
                                            ((INSTANCE) == TIM16_S) || \
                                            ((INSTANCE) == TIM17_S))

/****************** TIM Instances : supporting repetition counter *************/
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)  (((INSTANCE) == TIM1_S)  || \
                                                       ((INSTANCE) == TIM8_S)  || \
                                                       ((INSTANCE) == TIM15_S) || \
                                                       ((INSTANCE) == TIM16_S) || \
                                                       ((INSTANCE) == TIM17_S))

/****************** TIM Instances : supporting ADC triggering through TRGO2 ***/
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM8_S))

/******************* TIM Instances : Timer input XOR function *****************/
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM2_S)  || \
                                            ((INSTANCE) == TIM3_S)  || \
                                            ((INSTANCE) == TIM4_S)  || \
                                            ((INSTANCE) == TIM5_S)  || \
                                            ((INSTANCE) == TIM8_S)  || \
                                            ((INSTANCE) == TIM15_S))

/****************** TIM Instances : Advanced timer instances *******************/
#define IS_TIM_ADVANCED_INSTANCE(INSTANCE) (((INSTANCE) == TIM1_S)  || \
                                            ((INSTANCE) == TIM8_S))

/****************************** TSC Instances *********************************/
#define IS_TSC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == TSC_S)

/******************** USART Instances : Synchronous mode **********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || \
                                     ((INSTANCE) == USART2_S) || \
                                     ((INSTANCE) == USART3_S))

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || \
                                    ((INSTANCE) == USART2_S) || \
                                    ((INSTANCE) == USART3_S) || \
                                    ((INSTANCE) == UART4_S)  || \
                                    ((INSTANCE) == UART5_S))

/*********************** UART Instances : FIFO mode ***************************/
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || \
                                         ((INSTANCE) == USART2_S)  || \
                                         ((INSTANCE) == USART3_S)  || \
                                         ((INSTANCE) == UART4_S)   || \
                                         ((INSTANCE) == UART5_S)   || \
                                         ((INSTANCE) == LPUART1_S))

/*********************** UART Instances : SPI Slave mode **********************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || \
                                              ((INSTANCE) == USART2_S) || \
                                              ((INSTANCE) == USART3_S))

/****************** UART Instances : Auto Baud Rate detection ****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S) || \
                                                            ((INSTANCE) == USART2_S) || \
                                                            ((INSTANCE) == USART3_S) || \
                                                            ((INSTANCE) == UART4_S)  || \
                                                            ((INSTANCE) == UART5_S))

/****************** UART Instances : Driver Enable *****************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE)     (((INSTANCE) == USART1_S)  || \
                                                      ((INSTANCE) == USART2_S)  || \
                                                      ((INSTANCE) == USART3_S)  || \
                                                      ((INSTANCE) == UART4_S)   || \
                                                      ((INSTANCE) == UART5_S)   || \
                                                      ((INSTANCE) == LPUART1_S))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART1_S)  || \
                                                 ((INSTANCE) == USART2_S)  || \
                                                 ((INSTANCE) == USART3_S)  || \
                                                 ((INSTANCE) == UART4_S)   || \
                                                 ((INSTANCE) == UART5_S)   || \
                                                 ((INSTANCE) == LPUART1_S))

